export const cityData = {
  start:{
    name: '洛阳',
    N: 34.62,//维度
    E: 112.45,//经度
  },
  endArr:[{
    name: '深圳',
    N: 22,//维度
    E: 114,//经度
  },
  {
    name: '大理',
    N: 25.6,
    E: 100.2,
  },
  {
    name: '伊斯坦布尔',
    N: 41,
    E: 29,
  },
  {
    name: '冰岛',
    N: 65,
    E: -18,
  },
  {
    name: '格陵兰',
    N: 72,
    E: -40,
  },

  {
    name: '黑龙江',
    N: 48.5156,
    E: 128.1445,
  },
  
  {
    name: '新疆',
    N: 41.748,
    E: 84.9023,
  },
  
  {
    name: '德黑兰',
    N: 35,
    E: 51,
  },

  {
    name: '利比亚',
    N: 25, 
    E: 17,
  },
  {
    name: '惠灵顿',
    N: -41, 
    E: 174,
  },

  {
    name: '檀香山',
    N: 21, 
    E: -157,
  },
  {
    name: '怀特霍斯',
    N: 60, 
    E: -135,
  },
  {
    name: '缅甸',
    N: 16, 
    E: 96,
  },

    {
    name: '雅加达',
    N: 6, 
    E: 106,
  },
  {
    name: '珀斯',
    N: -31, 
    E: 115,
  },
  {
    name: '摩尔曼斯克',
    N: 68, 
    E: 33,
  },
  {
    name: '科伦坡',
    N: 6, 
    E: 79,
  },

  {
    name: '墨西哥城',
    N: 19, 
    E: -99,
  },
  {
    name: '亚的斯亚贝巴',
    N: 9, 
    E: 38,
  },
  {
    name: '内罗毕',
    N: -1, 
    E: 36,
  },
  {
    name: '巴西利亚',
    N: -15, 
    E: -47,
  },
  {
    name: '伦敦',
    N: 51.5,
    E: 0.1,
  },
  {
    name: '悉尼',
    N: -33.86,
    E: 151.21,
  },
  {
    name: '华盛顿',
    N: 38.89,
    E: -77.03,
  },
  {
    name: '河内',
    N: 21.03,
    E: 105.85,
  },
  {
    name: '曼谷',
    N: 13.75,
    E: 100.52,
  },
  {
    name: '马尼拉',
    N: 14.59,
    E: 120.98,
  },
  {
    name: '吉隆坡',
    N: 3.14,
    E: 101.69,
  },
  {
    name: '首尔',
    N: 37.56,
    E: 126.97,
  },
  {
    name: '柏林',
    N: 52.52,
    E: 13.40,
  },
  {
    name: '开罗',
    N: 30.05,
    E: 31.23,
  },
  {
    name: '哥本哈根',
    N: 55.67,
    E: 12.56,
  },
  {
    name: '布鲁塞尔',
    N: 50.85,
    E: 4.35,
  },
  {
    name: '布加勒斯特',
    N: 44.43,
    E: 26.10,
  },
  {
    name: '布达佩斯',
    N: 47.49,
    E: 19.04,
  },
  
  {
    name: '东京',
    N: 35,
    E: 139,
  },
  {
    name: '新加坡',
    N: 1,
    E: 103,
  },
  {
    name: '纽约',
    N: 40,
    E: -73,
  },

  {
    name: '莫斯科',
    N: 55.7,
    E: 55.6,
  },
  {
    name: '海参崴',
    N: 43,
    E: 132,
  },
  {
    name: '贝加尔湖',
    N: 53,
    E: 108,
  },
  {
    name: '列宁格勒',
    N: 60,
    E: 30,
  },
  {
    name: '新德里',
    N: 28.6,
    E: 77.2,
  },
  {
    name: '特拉维夫',
    N: 32,
    E: 34.8,
  },
  {
    name: '亚特兰大',
    N: 33.75,
    E: -84.39,
  },
  {
    name: '芝加哥',
    N: 41.88,
    E: -87.63,
  },
  {
    name: '底特律',
    N: 42.33,
    E: -83.05,
  },
  {
    name: '费城',
    N: 39.95,
    E: -75.17,
  },
  {
    name: '波士顿',
    N: 42.36,
    E: -71.06,
  },
  {
    name: '波特兰',
    N: 45.52,
    E: -122.68,
  },
  {
    name: '西雅图',
    N: 47.61,
    E: -122.33,
  },
  {
    name: '法属圭亚那',
    N: 4,
    E: -53,
  },
  {
    name: '圣保罗',
    N: -23.55,
    E: -46.63,
  },
  {
    name: '渥太华',
    N: 45.4,
    E: -75.7,
  },
  {
    name: '巴黎',
    N: 48.9,
    E: 2,
  },
  {
    name: '柏林',
    N: 52.5,
    E: 13,
  },
  {
    name: '沙特',
    N: 24,
    E: 45,
  },
  {
    name: '阿曼',
    N: 21,
    E: 57,
  },
  {
    name: '阿联酋',
    N: 24,
    E: 54,
  },
  {
    name: '罗马',
    N: 41.9,
    E: 12.6,
  },
  {
    name: '旧金山',
    N: 37.8,
    E: -122.5,
  },
  {
    name: '阿斯塔纳',
    N: 51.18,
    E: 71.45,
  },
  {
    name: '刚果',
    N: -4.4,
    E: 15.3,
  },
  {
    name: '南非',
    N: -29,
    E: 24,
  },
  {
    name: '约翰内斯堡',
    N: -26,
    E: 28,
  },
  {
    name: '坦桑尼亚',
    N: -6,
    E: 39,
  },
  {
    name: '喀麦隆',
    N: 4,
    E: 12,
  },
  {
    name: '加蓬',
    N: -0.8,
    E: 11.6,
  },
  {
    name: '加纳',
    N: 6.7,
    E: -1.6,
  },
  {
    name: '尼日尔',
    N: 16.5,
    E: 8.6,
  },
  {
    name: '乍得',
    N: 15.45,
    E: 18.73,
  },
  {
    name: '中非',
    N: 6.36,
    E: 20.79,
  },
  {
    name: '刚果金',
    N: -4.4,
    E: 15.3,
  },
  {
    name: '布隆迪',
    N: -3.37,
    E: 29.37,
  },
  {
    name: '卢旺达',
    N: -1.94,
    E: 29.87,
  },
  {
    name: '乌干达',
    N: 1.32,
    E: 32.58,
  },
  {
    name: '肯尼亚',
    N: -1,
    E: 38,
  },
  {
    name: '埃塞俄比亚',
    N: 9,
    E: 40,
  },
  {
    name: '哥伦比亚',
    N: 4,
    E: -74,
  },
  {
    name: '巴西',
    N: -15,
    E: -51,
  },
  {
    name: '阿根廷',
    N: -34,
    E: -64,
  },
  {
    name: '智利',
    N: -33,
    E: -71,
  },
  {
    name: '哥斯达黎加',
    N: 10,
    E: -84,
  },
  {
    name: '古巴',
    N: 23,
    E: -82,
  },
  {
    name: '多米尼加',
    N: 18.47,
    E: -69.94,
  },
  {
    name: '马达加斯加',
    N: -20,
    E: 47,
  },
  {
    name: '马拉维',
    N: -13.25,
    E: 34,
  },
  {
    name: '莫桑比克',
    N: -18.22,
    E: 39.28,
  },
  {
    name: '纳米比亚',
    N: -22.95,
    E: 18.46,
  },
  {
    name: '尼日利亚',
    N: 10,
    E: 8,
  },
  
  {
    name: '洛杉矶',
    N: 34.05,
    E: -118.25,
  },
  {
    name: '多伦多',
    N: 43.65,
    E: -79.38,
  },
  {
    name: '温哥华',
    N: 49.28,
    E: -123.12,
  },  
  {
    name: '渥太华',
    N: 45.4,
    E: -75.7,
  },
  {
    name: '蒙特利尔',
    N: 45.5,
    E: -73.5,
  },
  {
    name: '温尼伯',
    N: 49.88,
    E: -97.15,
  },
  {
    name: '卡尔加里',
    N: 51.05,
    E: -114.07,
  },
  {
    name: '埃德蒙顿',
    N: 53.55,
    E: -113.48,
  },
  {
    name: '魁北克',
    N: 46.8,
    E: -71.2,
  },
  {
    name: '巴塞罗那',
    N: 41.38,
    E: 2.16,
  },
  {
    name: '马德里',
    N: 40.4,
    E: -3.7,
  },
  {
    name: '里斯本',
    N: 38.72,
    E: -9.13,
  },
  {
    name: '摩洛哥',
    N: 31.79,
    E: -7.09,
  },
  {
    name: '阿富汗',
    N: 33,
    E: 65,
  },
  {
    name: '墨尔本',
    N: -37.9,
    E: 145,
  },
  
  {
    name: '里约热内卢',
    N: -23,
    E: -43.2,
  },
  {
    name: '圣地亚哥',
    N: -33.5,
    E: -70,
  },
  {
    name: '开普敦',
    N: -34,
    E: 18.5,
  },
  {
    name: '的黎波里',
    N: 33,
    E: 13.2,
  },
  {
    name: '伊斯坦布尔',
    N: 41,
    E: 29,
  },
  {
    name: '阿拉木图',
    N: 43.3,
    E: 77,
  },
  {
    name: '	班吉',
    N: 4.4,
    E: 18.6,
  },
  ]
}